# Different ways to create Dataframes

---
[Reference](https://www.geeksforgeeks.org/different-ways-to-create-pandas-dataframe/)

In [4]:
# List of Imports
import pandas as pd

In [19]:
# Lists of Lists
getinWorkers = [['fillipe', 31], ['paulo', 35], ['carlos', 48]]
getinWorkers.append(['galindo', 29])
workers = pd.DataFrame(getinWorkers, columns=['Name', 'Age'])
workers

      Name  Age
0  fillipe   31
1    paulo   35
2   carlos   48
3  galindo   29

In [23]:
# Dict of Narray or Lists
data = {'Name': ['Fillipe', 'Galindo', 'Gonçalo'], 'Age': [31, 25, 22]}
data['curte'] = [0,1,0]
df = pd.DataFrame(data)
df

      Name  Age  curte
0  Fillipe   31      0
1  Galindo   25      1
2  Gonçalo   22      0

In [52]:
# Using arrays and Indexes
data = {'Name':['Tom', 'Jack', 'nick', 'juli'], 'marks':[99, 98, 95, 90]} 
df = pd.DataFrame(data, index=['index1','index2','index3' ,'index4'])
df.loc['index1']

Name     Tom
marks     99
Name: index1, dtype: object

In [37]:
# Using a List of Dicts and index list! Can be used without Index
data = [{'a': 1, 'b': 2, 'c':3}, {'a':10, 'b': 20, 'c': 30}, {'a':0, 'b': 20, 'c': 3}] 
df = pd.DataFrame(data, index=['resultados1', 'resultados2','resultados3'])
# df = pd.DataFrame(data)
df

              a   b   c
resultados1   1   2   3
resultados2  10  20  30
resultados3   0  20   3

In [41]:
# Using list of Dicts with both Index and Collumns
data =  [{'a': 1, 'b': 2, 'c':3}, {'a':10, 'b': 20, 'c': 30}, {'a':0, 'b': 20, 'c': 3}] 
   
# With two column indices, values same  
# as dictionary keys 
df1 = pd.DataFrame(data, index=['first','second','third'], columns=['a','b'])
df1

         a   b
first    1   2
second  10  20
third    0  20

In [43]:
df2 = pd.DataFrame(data, index=['first','second','third'], columns=['a', 'b1'])
df2

         a  b1
first    1 NaN
second  10 NaN
third    0 NaN

In [46]:
# Using Lists and Zip
names = ['Fillipe', 'Carlos', 'Paulo', 'Jan']
age = [10, 11, 12, 13]
list_of_tuple = (list(zip(names,age)))
list_of_tuple
df = pd.DataFrame(list_of_tuple, columns=['Name', 'Age'])
df

      Name  Age
0  Fillipe   10
1   Carlos   11
2    Paulo   12
3      Jan   13

In [49]:
# DataFrame from Dict of Series
s1 = pd.Series([10, 20, 30, 40], index =['a', 'b', 'c', 'd'])
s2 = pd.Series([10, 20, 30, 40], index =['a', 'b', 'c', 'd'])
myDict = {'one': s1, 'two': s2}
df = pd.DataFrame(myDict)
df

   one  two
a   10   10
b   20   20
c   30   30
d   40   40

In [54]:
df.drop('index1')

        Name  marks
index2  Jack     98
index3  nick     95
index4  juli     90

In [55]:
df

        Name  marks
index1   Tom     99
index2  Jack     98
index3  nick     95
index4  juli     90